assignment7/app/controllers/customers_controller.rb

INSERT INTO "customers" ("email", "lastName", "firstName", "lastOrder", "lastOrder2", "lastOrder3", "award") VALUES (?, ?, ?, ?, ?, ?, ?)  [["email", "blazeking@gmail.com"], ["lastName", "King"], ["firstName", "Blaze"], ["lastOrder", 0.0], ["lastOrder2", 0.0], ["lastOrder3", 0.0], ["award", 0.0]]
---
  def create
    customerCreated = nil
    @customer = Customer.new
    @customer.email = params[:email]
    @customer.lastName = params[:lastName]
    @customer.firstName = params[:firstName]
    @customer.lastOrder = 0
    @customer.lastOrder2 = 0
    @customer.lastOrder3 = 0
    @customer.award = 0
    customerCreated = @customer.save

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "blazeking@gmail.com"], ["LIMIT", 1]]
---
  def get

    @id = params[:id]
    @email = params[:email]
    @customer = nil
    if !@id.nil?
      @customer = Customer.find_by(id: @id)
    elsif !@email.nil?
      @customer = Customer.find_by(email: @email)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "lastOrder2" = ?, "lastOrder3" = ?, "lastOrder" = ?, "award" = ? WHERE "customers"."id" = ?  [["lastOrder2", 120.0], ["lastOrder3", 250.0], ["lastOrder", 490.0], ["award", 28.666666666666668], ["id", 1]]
---
  def processOrder
    @id = params[:customerId]
    @award = params[:award]
    @total = params[:total]
    @customer = Customer.find_by(id: @id)

    if @award == 0
      @customer.lastOrder3 = @customer.lastOrder2
      @customer.lastOrder2 = @customer.lastOrder
      @customer.lastOrder = @total

      if @customer.lastOrder3 != 0 && @customer.lastOrder2 != 0 &&
        @customer.lastOrder != 0
        @customer.award = (0.10 * (@customer.lastOrder + @customer.lastOrder2 + @customer.lastOrder3)/3.0).round(2)
      end
    else
      @customer.award = 0
      @customer.lastOrder = 0
      @customer.lastOrder2 = 0
      @customer.lastOrder3 = 0
    end

    @customer.save