assignment7/app/controllers/items_controller.rb

  def create
    itemCreated = nil
    @item = Item.new
    @item.description = params[:description]
    @item.price = params[:price]
    @item.stockQty = params[:stockQty]
    itemCreated = @item.save
---
INSERT INTO "items" ("description", "price", "stockQty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "frank"], ["price", 5.0], ["stockQty", 5], ["created_at", "2019-07-31 00:52:18.287325"], ["updated_at", "2019-07-31 00:52:18.287325"]]

  def get

    @id = params[:id]
    @item = nil
    if !@id.nil?
      @item = Item.find_by(id: @id)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @id = params[:itemId]
    @price = params[:price]
    @description = params[:description]
    @stockQty = params[:stockQty]

    @item = Item.find_by(id: @id)

    @item.description = @description
    @item.price = @price
    @item.stockQty = @stockQty

    @item.save
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "description" = ?, "price" = ?, "stockQty" = ? WHERE "items"."id" = ?  [["description", "Frank Is good"], ["price", 8.99], ["stockQty", 5], ["id", 1]]

  def updateItem
    itemUpdate = nil
    @id = params[:itemId]
    @item = Item.find_by(id: @id)

    @item.stockQty -= 1

    itemUpdate = @item.save
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "description" = ?, "price" = ?, "stockQty" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "Frank"], ["price", 5.0], ["stockQty", 10], ["updated_at", "2019-07-31 01:04:07.859944"], ["id", 2]]